# Taps
tap "1password/tap"
tap "homebrew/bundle"
tap "yt-dlp/taps"

# Unix tools
brew "coreutils"
brew "curl"
brew "gawk"
brew "htop"
brew "nmap"
brew "ssh-copy-id"
brew "tree"
brew "watch"
brew "wget"

# Git
brew "git"
brew "hub"

brew "ansible"
# Runtime versions management CLI
brew "asdf"
brew "awscli"
# BLAKE3 hashing
brew "b3sum"
# cat clone with syntax highlighting and Git integration
brew "bat"
brew "cloudflared"
brew "direnv"
brew "exiftool"
# Quick access to files and directories
brew "fasd"
brew "fclones"
brew "fdupes"
brew "ffmpeg"
brew "gnupg", link: false
brew "imagemagick"
brew "iperf3"
# Command-line JSON processor
brew "jq"
# Git client
brew "lazygit"
brew "mitmproxy"
brew "sops"
brew "speedtest-cli"
brew "watchman"
# Extremely fast hash algorithm
brew "xxhash"
# File compression
brew "xz"
# Command-line YAML, JSON and XML processor
brew "yq"
# Youtuve downloader
brew "yt-dlp"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "bleunlock"
cask "discord"
cask "docker"
cask "fanny"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "obsidian"
cask "omnidisksweeper"
cask "openscad"
cask "postman"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
